from PRINCEMUSIC import app 
import asyncio
import random
from pyrogram import Client, filters
from pyrogram.enums import ChatType, ChatMemberStatus
from pyrogram.errors import UserNotParticipant
from pyrogram.types import ChatPermissions

spam_chats = []

EMOJI = [ "🦋🦋🦋🦋🦋",
          "🧚🌸🧋🍬🫖",
          "🥀🌷🌹🌺💐",
          "🌸🌿💮🌱🌵",
          "❤️💚💙💜🖤",
          "💓💕💞💗💖",
          "🌸💐🌺🌹🦋",
          "🍔🦪🍛🍲🥗",
          "🍎🍓🍒🍑🌶️",
          "🧋🥤🧋🥛🍷",
          "🍬🍭🧁🎂🍡",
          "🍨🧉🍺☕🍻",
          "🥪🥧🍦🍥🍚",
          "🫖☕🍹🍷🥛",
          "☕🧃🍩🍦🍙",
          "🍁🌾💮🍂🌿",
          "🌨️🌥️⛈️🌩️🌧️",
          "🌷🏵️🌸🌺💐",
          "💮🌼🌻🍀🍁",
          "🧟🦸🦹🧙👸",
          "🧅🍠🥕🌽🥦",
          "🐷🐹🐭🐨🐻‍❄️",
          "🦋🐇🐀🐈🐈‍⬛",
          "🌼🌳🌲🌴🌵",
          "🥩🍋🍐🍈🍇",
          "🍴🍽️🔪🍶🥃",
          "🕌🏰🏩⛩️🏩",
          "🎉🎊🎈🎂🎀",
          "🪴🌵🌴🌳🌲",
          "🎄🎋🎍🎑🎎",
          "🦅🦜🕊️🦤🦢",
          "🦤🦩🦚🦃🦆",
          "🐬🦭🦈🐋🐳",
          "🐔🐟🐠🐡🦐",
          "🦩🦀🦑🐙🦪",
          "🐦🦂🕷️🕸️🐚",
          "🥪🍰🥧🍨🍨",
          " 🥬🍉🧁🧇",
        ]

TAGMES = [ " **❅ عزیزم کجایی؟ 🤗** ",
           " **❅ هی خوابیدی؟ آنلاین شو 😊** ",
           " **❅ بیا تماس تصویری حرف بزنیم 😃** ",
           " **❅ غذا خوردی یا نه؟ 🥲** ",
           " **❅ خانواده چطورن؟ 🥺** ",
           " **❅ میدونی چقدر دلم برات تنگ شده 🤭** ",
           " **❅ خب تعریف کن چطوری؟ 🤨** ",
           " **❅ برای منم یه دوست پیدا کن لطفاً 🙂** ",
           " **❅ اسمت چیه؟ 🥲** ",
           " **❅ صبحانه خوردی؟ 😋** ",
           " **❅ منو به گروهت اضافه کن 😍** ",
           " **❅ دوستت داره صدات میکنه 😅** ",
           " **❅ با من ازدواج میکنی؟ 🤔** ",
           " **❅ رفتی بخوابی؟ 🙄** ",
           " **❅ یکی کولر رو روشن کنه 😕** ",
           " **❅ اهل کجایی؟ 🙃** ",
           " **❅ سلام و درود 😛** ",
           " **❅ عزیزم چیکار میکنی؟ 🤔** ",
           " **❅ منو میشناسی؟ ☺️** ",
           " **❅ بیا منچ بازی کنیم عزیزم 🤗** ",
           " **❅ از ۹ تا ۱۲ وقت داری؟ 😇** ",
           " **❅ بابات چیکارست؟ 🤭** ",
           " **❅ بیا بریم بازار فلافل بخوریم عزیزم 🥺** ",
           " **❅ تنهایی نرو بازار، چشم میخوری 😶** ",
           " **❅ دوست پسرت چطوره؟ 🤔** ",
           " **❅ صبح بخیر 😜** ",
           " **❅ یه کاری برام میکنی؟ 🙂** ",
           " **❅ آقای دی جی آهنگ ما رو بذار 😪** ",
           " **❅ از آشناییت خوشحال شدم ☺** ",
           " **❅ عزیزم غذا خوردی؟ 🙊** ",
           " **❅ درس و مشق چطور پیش میره؟ 😺** ",
           " **❅ عاشق شدم 🥲** ",
           " **❅ نایکا کیه؟ 😅** ",
           " **❅ از من عکس بگیر 😅** ",
           " **❅ قطع کن مامانم اومد 😆** ",
           " **❅ کی با زن داداشت آشنامون میکنی؟ 😉** ",
           " **❅ دوستم داری؟ 💚** ",
           " **❅ من خیلی دوستت دارم 👀** ",
           " **❅ عزیزم یه بوس بده 🙉** ",
           " **❅ یه جوک بگم؟ 😹** ",
           " **❅ بیا تماس تصویری یه چیزی نشونت بدم 😻** ",
           " **❅ اینستاگرام داری؟ 🙃** ",
           " **❅ شماره واتساپت رو میدی؟ 😕** ",
           " **❅ با دوستت منو آشنا کن 🙃** ",
           " **❅ کارت تموم شد بیا آنلاین 🙃** ",
           " **❅ اهل کجایی؟ 😊** ",
           " **❅ از قلبم آزادت کردم 🥺** ",
           " **❅ یه کمکی میکنی؟ چندتا عضو به گروه اضافه کن ♥️** ",
           " **❅ من ازت ناراحتم 😠** ",
           " **❅ خانواده خوبن؟ ❤** ",
           " **❅ چی شده؟ 🤔** ",
           " **❅ خیلی دلم برات تنگ شده 😒** ",
           " **❅ منو فراموش کردی 😏** ",
           " **❅ چرا بهم دروغ گفتی 🤐** ",
           " **❅ اینقدر ناز نکن، غذاتو بخور حداقل چاق شی 😒** ",
           " **❅ این غرور رو برای کی میگیری 😮** ",
           " **❅ سلام کجا مشغولی 👀** ",
           " **❅ خیلی خوشحالم که دوستی مثل تو دارم 🙈** ",
           " **❅ امروز خیلی دلم گرفته ☹️** ",
           " **❅ با منم حرف بزن دیگه 🥺** ",
           " **❅ امروز چی پختی؟ 👀** ",
           " **❅ چه خبر؟ 🙂** ",
           " **❅ چرا پیام نمیدی؟ 🥺** ",
           " **❅ من معصومم نه؟ 🥺** ",
           " **❅ دیروز خوش گذشت نه؟ 😅** ",
           " **❅ دیروز کجا مشغول بودی؟ 😕** ",
           " **❅ تو رابطه داری؟ 👀** ",
           " **❅ چقدر ساکتی تو 😼** ",
           " **❅ آواز خوندن بلدی؟ 😸** ",
           " **❅ میای بریم بیرون؟ 🙈** ",
           " **❅ همیشه شاد باش 🤞** ",
           " **❅ میشه باهم دوست باشیم؟ 🥰** ",
           " **❅ ازدواج کردی؟ 🥺** ",
           " **❅ این چند روز کجا مشغول بودی؟ 🥲** ",
           " **❅ مجردی یا متاهل؟ 😉** ",
           " **❅ بیا جشن بگیریم 🥳** ",
           " **❅ لینک تو بیو هست عضو شو 🧐** ",
           " **❅ من دوستت ندارم 🥺** ",
           " **❅ بیا اینجا خوش میگذره 🤭** ",
           " **❅ منو فراموش کن 😊** ",
           " **❅ منو مال خودت کن عزیزم 🥺** ",
           " **❅ گروه منم عضو شو 🤗** ",
           " **❅ اسمت رو گذاشتم عشق 😗** ",
           " **❅ همه دوستات کجا رفتن؟ 🥺** ",
           " **❅ مالک نازم 🥰** ",
           " **❅ تو فکر کی غرق شدی عزیزم؟ 😜** ",
           " **❅ شب بخیر عزیزم دیر وقته 🥰** "
           ]

VC_TAG = [ "**❅ اگر به جلو حرکت نکنی، در همان جا خواهی ماند.**",
         "**❅ زندگی سخت است اما غیرممکن نیست.**",
         "**❅ زندگی خیلی کوتاه‌تر از آن است که بخواهیم بحث و دعوا کنیم.**",
         "**❅ منتظر لحظه کامل نباش، لحظه را بگیر و آن را کامل کن.**",
         "**❅ سکوت بهترین پاسخ به کسی است که ارزش حرف‌هایت را نمی‌داند.**",
         "**❅ هر روز جدید فرصتی برای تغییر زندگی‌ات است.**",
         "**❅ برای تغییر زندگی‌ات، باید اولویت‌هایت را تغییر دهی.**",
         "**❅ زندگی یک سفر است، نه یک مسابقه.**",
         "**❅ لبخند بزن و نگران نباش، زندگی عالی است.**",
         "**❅ خودت را با دیگران مقایسه نکن، اگر این کار را بکنی به خودت توهین کرده‌ای.**",
         "**❅ من در مسیر تبدیل شدن به بهترین نسخه خودم هستم.**",
         "**❅ زندگی مثل یخ است، قبل از آب شدنش از آن لذت ببر.**",
         "**❅ مثل پرنده آزاد باش.**",
         "**❅ هیچکس نمی‌آید تو را نجات دهد. این زندگی ۱۰۰٪ مسئولیت خودت است.**",
         "**❅ زندگی همیشه به تو فرصت دوم می‌دهد. اسمش فردا است.**",
         "**❅ زندگی در انتهای منطقه امن تو شروع می‌شود.**",
         "**❅ همه چیزهایی که به تو آسیب می‌زنند، در واقع به تو آموزش می‌دهند.**",
         "**❅ زندگی مثل دوربین است. پس با لبخند با آن روبرو شو.**",
         "**❅ زندگی ۱۰٪ چیزی است که برایت اتفاق می‌افتد و ۹۰٪ چگونگی واکنش تو به آن.**",
         "**❅ زندگی همیشه به تو فرصت دوم می‌دهد. اسمش فردا است.**",
         "**❅ هیچکس نمی‌آید تو را نجات دهد. این زندگی ۱۰۰٪ مسئولیت خودت است.**",
         "**❅ زندگی کار آسانی نیست.**",
         "**❅ زندگی یک ماجراجویی شگفت‌انگیز است.**",
         "**❅ زندگی در آن سوی ناامیدی آغاز می‌شود.**",
         "**❅ زندگی مسئله‌ای نیست که حل شود، واقعیتی است که باید تجربه شود.**",
         "**❅ زندگی کنترل از راه دور ندارد؛ بلند شو و خودت آن را تغییر بده.**",
         "**❅ به خودت اعتماد کن، و خواهی دانست چگونه زندگی کنی.**",
         "**❅ سلامتی مهمترین نعمت زندگی است.**",
         "**❅ زمان که تغییر می‌کند، اولویت‌ها هم تغییر می‌کنند.**",
         "**❅ دیدن و احساس کردن یعنی بودن، فکر کردن و زندگی کردن.**",
         "**❅ با کسی باش که بهترین‌ها را در تو بیرون می‌آورد.**",
         "**❅ افکارت زندگی‌ات هستند.**",
         "**❅ آدم‌ها تغییر می‌کنند، خاطرات نه.**",
         "**❅ زندگی ما همان چیزی است که فکر می‌کنیم هست.**",
         "**❅ قلب سبک، عمر طولانی دارد.**",
         "**❅ افسردگی نهایتاً تبدیل به عادت می‌شود.**",
         "**❅ زندگی یک هدیه است. خوب از آن مراقبت کن.**",
         "**❅ زندگی همان چیزی است که احساسات ما با ما می‌کنند.**",
         "**❅ چین و چروک‌ها خطوط زندگی روی صورت هستند.**",
         "**❅ زندگی از گریه‌ها، فین‌فین‌ها و لبخندها ساخته شده.**",
         "**❅ نه زندگی، بلکه زندگی خوب است که باید ارزشمند شمرده شود.**",
         "**❅ با تغییر قلبت، زندگی‌ات را تغییر می‌دهی.**",
         "**❅ زندگی بدون دوستی واقعی هیچ است.**",
         "**❅ اگر شجاعت خداحافظی داشته باشی، زندگی با یک سلام جدید پاداشت می‌دهد.**",
         "**❅ هیچ چیز در دنیا هیجان‌انگیزتر از مردم نیست.**",
         "**❅ تو می‌توانی هر کاری را انجام دهی، اما نه همه کارها را.**",
         "**❅ زندگی وقتی آسان می‌شود که تو قوی شوی.**",
         "**❅ زندگی من کامل نیست اما لحظات کاملی دارد.**",
         "**❅ زندگی رمان خداست. بگذار او آن را بنویسد.**",
         "**❅ زندگی ما نتیجه افکار غالب ماست.**",
         "**❅ زندگی حرکتی از یک خواسته به خواسته دیگر است.**",
         "**❅ زندگی کردن یعنی جنگیدن.**",
         "**❅ زندگی مثل کوه است، نه ساحل.**",
         "**❅ بدترین چیز در زندگی این است که می‌گذرد.**",
         "**❅ اگر ما ساده باشیم، زندگی ساده است.**",
         "**❅ همیشه دوبار فکر کن، یکبار حرف بزن.**",
         "**❅ زندگی ساده است، ما آن را پیچیده می‌کنیم.**",
         "**❅ زندگی خیلی از مرگ پیرتر نیست.**",
         "**❅ راز زندگی در انتظارات کم است!**",
         "**❅ زندگی یک معلم است... هر چه بیشتر زندگی کنیم، بیشتر یاد می‌گیریم.**",
         "**❅ زندگی انسان چیزی جز یک توهم ابدی نیست.**",
         "**❅ هر چه زمان شادتر، کوتاه‌تر است.**",
         "**❅ زندگی زیباست اگر بدانی کجا را نگاه کنی.**",
         "**❅ زندگی با تو در کنارم عالی است.**",
         "**❅ زندگی منهای عشق مساوی صفر است**",
         "**❅ زندگی پر از مبارزه است.**",
         "**❅ کم داشتم اما بهترین‌ها را داشتم**",
         "**❅ زندگی ۱۰٪ آن چیزی است که می‌سازی، و ۹۰٪ چگونگی پذیرش آن.**",
         "**❅ هنوز خیلی چیزها برای دیدن هست**",
         "**❅ زندگی آسان‌تر نمی‌شود، تو قوی‌تر می‌شوی.**",
         "**❅ زندگی درباره خندیدن و زندگی کردن است.**",
         "**❅ هر کس وقتی زمانش برسد می‌میرد.**"
        ]


@app.on_message(filters.command(["hitag" ], prefixes=["/", "@", "#"]))
async def mentionall(client, message):
    chat_id = message.chat.id
    if message.chat.type == ChatType.PRIVATE:
        return await message.reply("๏ ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ ᴏɴʟʏ ғᴏʀ ɢʀᴏᴜᴘs.")

    is_admin = False
    try:
        participant = await client.get_chat_member(chat_id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("๏ ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ᴀᴅᴍɪɴ ʙᴀʙʏ, ᴏɴʟʏ ᴀᴅᴍɪɴs ᴄᴀɴ ᴛᴀɢ ᴍᴇᴍʙᴇʀs. ")

    if message.reply_to_message and message.text:
        return await message.reply("/hitag ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ ᴛʏᴘᴇ ʟɪᴋᴇ ᴛʜɪs / ʀᴇᴘʟʏ ᴀɴʏ ᴍᴇssᴀɢᴇ ɴᴇxᴛ ᴛɪᴍᴇ ʙᴏᴛ ᴛᴀɢɢɪɴɢ...")
    elif message.text:
        mode = "text_on_cmd"
        msg = message.text
    elif message.reply_to_message:
        mode = "text_on_reply"
        msg = message.reply_to_message
        if not msg:
            return await message.reply("/hitag ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ ᴛʏᴘᴇ ʟɪᴋᴇ ᴛʜɪs / ʀᴇᴘʟʏ ᴀɴʏ ᴍᴇssᴀɢᴇ ɴᴇxᴛ ᴛɪᴍᴇ ғᴏᴛ ᴛᴀɢɢɪɴɢ...")
    else:
        return await message.reply("/hitag ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ ᴛʏᴘᴇ ʟɪᴋᴇ ᴛʜɪs / ʀᴇᴘʟʏ ᴀɴʏ ᴍᴇssᴀɢᴇ ɴᴇxᴛ ᴛɪᴍᴇ ʙᴏᴛ ᴛᴀɢɢɪɴɢ...")
    if chat_id in spam_chats:
        return await message.reply("๏ ᴘʟᴇᴀsᴇ ᴀᴛ ғɪʀsᴛ sᴛᴏᴘ ʀᴜɴɴɪɴɢ ᴍᴇɴᴛɪᴏɴ ᴘʀᴏᴄᴇss...")
    spam_chats.append(chat_id)
    usrnum = 0
    usrtxt = ""
    async for usr in client.get_chat_members(chat_id):
        if not chat_id in spam_chats:
            break
        if usr.user.is_bot:
            continue
        usrnum += 1
        usrtxt += f"[{usr.user.first_name}](tg://user?id={usr.user.id}) "

        if usrnum == 1:
            if mode == "text_on_cmd":
                txt = f"{usrtxt} {random.choice(TAGMES)}"
                await client.send_message(chat_id, txt)
            elif mode == "text_on_reply":
                await msg.reply(f"[{random.choice(EMOJI)}](tg://user?id={usr.user.id})")
            await asyncio.sleep(4)
            usrnum = 0
            usrtxt = ""
    try:
        spam_chats.remove(chat_id)
    except:
        pass


@app.on_message(filters.command(["lifetag"], prefixes=["/", "@", "#"]))
async def mention_allvc(client, message):
    chat_id = message.chat.id
    if message.chat.type == ChatType.PRIVATE:
        return await message.reply("๏ ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ ᴏɴʟʏ ғᴏʀ ɢʀᴏᴜᴘs.")

    is_admin = False
    try:
        participant = await client.get_chat_member(chat_id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("๏ ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ᴀᴅᴍɪɴ ʙᴀʙʏ, ᴏɴʟʏ ᴀᴅᴍɪɴs ᴄᴀɴ ᴛᴀɢ ᴍᴇᴍʙᴇʀs. ")
    if chat_id in spam_chats:
        return await message.reply("๏ ᴘʟᴇᴀsᴇ ᴀᴛ ғɪʀsᴛ sᴛᴏᴘ ʀᴜɴɴɪɴɢ ᴍᴇɴᴛɪᴏɴ ᴘʀᴏᴄᴇss...")
    spam_chats.append(chat_id)
    usrnum = 0
    usrtxt = ""
    async for usr in client.get_chat_members(chat_id):
        if not chat_id in spam_chats:
            break
        if usr.user.is_bot:
            continue
        usrnum += 1
        usrtxt += f"[{usr.user.first_name}](tg://user?id={usr.user.id}) "

        if usrnum == 1:
            txt = f"{usrtxt} {random.choice(VC_TAG)}"
            await client.send_message(chat_id, txt)
            await asyncio.sleep(4)
            usrnum = 0
            usrtxt = ""
    try:
        spam_chats.remove(chat_id)
    except:
        pass



@app.on_message(filters.command(["cancel", "histop", "lifestop"]))
async def cancel_spam(client, message):
    if not message.chat.id in spam_chats:
        return await message.reply("๏ ᴄᴜʀʀᴇɴᴛʟʏ ɪ'ᴍ ɴᴏᴛ ᴛᴀɢɢɪɴɢ ʙᴀʙʏ.")
    is_admin = False
    try:
        participant = await client.get_chat_member(message.chat.id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("๏ ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ᴀᴅᴍɪɴ ʙᴀʙʏ, ᴏɴʟʏ ᴀᴅᴍɪɴs ᴄᴀɴ ᴛᴀɢ ᴍᴇᴍʙᴇʀs.")
    else:
        try:
            spam_chats.remove(message.chat.id)
        except:
            pass
        return await message.reply("๏ ᴍᴇɴᴛɪᴏɴ ᴘʀᴏᴄᴇss sᴛᴏᴘᴘᴇᴅ ๏")
