from PRINCEMUSIC import app 
import asyncio
import random
from pyrogram import Client, filters
from pyrogram.enums import ChatType, ChatMemberStatus
from pyrogram.errors import UserNotParticipant
from pyrogram.types import ChatPermissions

spam_chats = []

EMOJI = [ "🦋🦋🦋🦋🦋",
          "🧚🌸🧋🍬🫖",
          "🥀🌷🌹🌺💐",
          "🌸🌿💮🌱🌵",
          "❤️💚💙💜🖤",
          "💓💕💞💗💖",
          "🌸💐🌺🌹🦋",
          "🍔🦪🍛🍲🥗",
          "🍎🍓🍒🍑🌶️",
          "🧋🥤🧋🥛🍷",
          "🍬🍭🧁🎂🍡",
          "🍨🧉🍺☕🍻",
          "🥪🥧🍦🍥🍚",
          "🫖☕🍹🍷🥛",
          "☕🧃🍩🍦🍙",
          "🍁🌾💮🍂🌿",
          "🌨️🌥️⛈️🌩️🌧️",
          "🌷🏵️🌸🌺💐",
          "💮🌼🌻🍀🍁",
          "🧟🦸🦹🧙👸",
          "🧅🍠🥕🌽🥦",
          "🐷🐹🐭🐨🐻‍❄️",
          "🦋🐇🐀🐈🐈‍⬛",
          "🌼🌳🌲🌴🌵",
          "🥩🍋🍐🍈🍇",
          "🍴🍽️🔪🍶🥃",
          "🕌🏰🏩⛩️🏩",
          "🎉🎊🎈🎂🎀",
          "🪴🌵🌴🌳🌲",
          "🎄🎋🎍🎑🎎",
          "🦅🦜🕊️🦤🦢",
          "🦤🦩🦚🦃🦆",
          "🐬🦭🦈🐋🐳",
          "🐔🐟🐠🐡🦐",
          "🦩🦀🦑🐙🦪",
          "🐦🦂🕷️🕸️🐚",
          "🥪🍰🥧🍨🍨",
          " 🥬🍉🧁🧇",
        ]
        ####
        
SHAYRI = [
    " 🌺**عذاب دادنت و بعد با عشق دلداریت خیلی حس خوبیه ",
    " 🌺**زندگی من زندگی من، تو نام دوم آرامش منی.**🌺 \n\n**🥀زندگی مری زندگی من است، تو نام دوم آرامش منی.🥀** ",
    " 🌺**تو خوشبختی من هستی که بدون کی، همه خوشبختی من ناقص به نظر می رسد.**🌺 \n\n**🥀**تو خوشبختی من هستی، بدون او، همه خوشبختی من ناقص به نظر می رسد.🥀** ",
    " 🌺**کاش اون روز زودتر بیاد، وقتی هفت دور با من گره میشی.**🌺 \n\n** ",
    " 🌺**دستت را بر دلم بگذار و دلت را به نام من بساز.**🌺\n\n**🥀دستت را بر قلبم بگذار و دلت را به نام من بساز.🥀** ",
    " 🌺**مهادف نه ماشین لازم است نه خانه ییلاقی، عشق من سالم بماند، فقط این دعاها لازم است. ",
    " 🌺**نگران خواهی شد که تنها عشق منی.**🌺 \n\n**🥀نگران خواهی شد که تنها عشق من هستی.🥀** ",
    " 🌺**گوش کن عزیزم تو فقط مواظب آشپزخونه هستی من اینجام تا ازت مراقبت کنم از تو.🥀** ",
    " 🌺**یک چیز از صد، من فقط شرکت شما را می خواهم.**🌺 \n\n**🥀پس یک چیز از صد، من فقط شرکت شما را می خواهم.🥀** ",
    " 🌺**من تو را با سختی های زیادی پیدا کردم، حالا نمی خواهم تو را از دست بدهم، حالا نمی خواهم مال تو باشم و نمی خواهم مال دیگران باشم.🥀**. ",
    " 🌺**عزیزم ما هر روز حرف میزنیم بیا امروز عاشقانه انجام بدیم ",
    " 🌺**صبح و غروب به یادت هستیم و دیگر چه بگوییم که چقدر دوستت داریم.**🌺 \n\n**🥀صبح و غروب به یادت هستیم و دیگر چه بگوییم چگونه خیلی دوستت داریم.🥀 ** ",
    " 🌺**احساس عاشق شدن به کسی اسمش عشق نیست. ",
    " 🌺**تو کلید قفل دلم هستی چی بهت بگم عزیزم تو تنها دلیل زندگی منی**🌺 \n\n**🥀تو کلید قفل قلب منی چی بگم عزیزم تو تنها چهره زندگی منی..🥀**. ",
    " 🌺**ما همه چیز تو را دوست خواهیم داشت، به همه چیز تو اعتماد خواهیم کرد، فقط یک بار بگو که تو فقط مال منی، ما تمام عمر منتظرت خواهیم بود.**🌺 \n\n**🥀هوم من همه را دوست خواهم داشت مال تو من به همه چیزت احترام میذارم فقط یه بار بگو تو فقط مال منی تا آخر عمرم منتظرت میمونم..🥀** ",
    " 🌺**عشق هرگز با افراد خاص اتفاق نمی افتد، هر که عاشق شود خاص می شود.**🌺 \n\n**🥀عشق هرگز با افراد خاص اتفاق نمی افتد، هر که عاشق شود خاص می شود.",
    " 🌺**تو جان منی، شکی در آن نیست، هیچکس جز تو حقی بر من ندارد.**🌺 \n\n**🥀تو جان منی، شکی نیست که هیچکس دیگری ندارد حق من جز توست.. 🥀** ",
    " 🌺**نمیتونستیم عشق اولم رو بشناسیم، نمیتونستیم تشخیص بدیم عشق چیه، اونقدر تو دلمون نگهش داشتیم که هر وقت خواستیم نتونستیم از دلمون بیرونش کنیم.**🌺 \ n\n**🥀پهلی من نمیدانم عشق چیست، نمیدانم، آنقدر در دلم نگهش داشته ام که هر وقت خواستم نتوانستم آن را از قلبم بیرون کنم.🥀** ",
    " 🌺**نمیدونم چقدر برام عزیزه، میدونم از زندگیم برام عزیزتره، فاصله مهم نیست، دیروز مال ما بود و امروز هم.**🌺 \n\ n**🥀خود مهم نیست چقدر برای من عزیز است، او برای من عزیزتر از جان من است، مهم نیست که او مال دیروز ما بود یا مال امروز ما.🥀** ",
    " 🌺**تو پنهان می آیی و وارد این دل می شوی، در نفسم عطر من می شوی و می پراکنی، یک جورهایی جادوی عشقت کار کرده است، تو تنها کسی هستی که در خواب و بیداری می بینم.**🌺 \n\ n**🥀تو این شکلی بی صدا وارد قلبم میشی، همونطوری که عطر من لبها رو پر میکنه، جادوی عشقم رو پخش میکنی، تو خواب به من نگاه میکنی..🥀** ",
    " 🌺**دوست داشتن را آموخته ام، جای نفرت نیست، فقط تو هستی در این قلب، هیچ کس دیگری نیست.**🌺 \n\n**برای نفرت، فقط تو هستی، هیچ کس دیگری در این قلب نیست. ",
    " 🌺**خوشبختی شما را از خدا میخواهیم، ​​خنده شما را در دعاهایمان میخواهیم، ​​در شگفتیم که از شما چه بخواهیم، ​​عشق مادام العمر شما را بخواهیم.**🌺\n\n**🥀از شما میخواهیم شادی از خدا در دعای ما خنده هایت را میخواهم، در شگفتم که چه میخواهم، عشق تمام عمرت را میخواهم..** ",
    " 🌺**ای کاش لبهایم به لبهایت می رسید، فقط صورت تو دیده می شد، رابطه مان طوری می شد که دلمان هم به لب هایمان پیوند می خورد.**🌺\n\n**اگر به قیافه ات نگاه کنیم آنقدر رابطه مان آسان می شود که دل ما هم با تو شاد می شود.🥀** ",
    " 🌺 **اجازه بده امروز این را به تو بگویم، بگذار امروز عصر را تزئین کنم، مرا اسیر عشق خودت کن، بگذار امروز جانم را فدای تو کنم.**🌺\n\n**🥀 به من اجازه بده تا امروز این را به تو بگو، به من اجازه بده تا امروز این شرم را به تو نشان دهم، به من اجازه بده امروز جانم را فدای تو کنم..🥀** ",
    " 🌺 **What names do they give without love, we name you love.**🌺\n\n**🥀 Know what names they give for love, we name you love..🥀**. ",
    " 🌺**بعد از دیدن ما سرشان را خم می کنند. زنگ زدن و دزدی به جمع نگاه می کند. مهم نیست از ما متنفری اما چرا با ملاقات با غریبه ها دل ما را می سوزانید **🌺\n\n**🥀دیدیم که در جمع سر به زیر می اندازیم، از خودمان متنفریم، هیچ نمی دانیم اما چرا دل می سوزانیم؟ وقتی با غریبه ها ملاقات می کنیم.🥀** ",
    " 🌺**بی تو از هم می پاشیم، اگر تو را ببینیم مثل گل می شکفیم، اگر تو را نبینیم زنده می میریم، اگر تو را پیدا کنیم بعد از مردن هم زنده ایم.**🌺\n\n**🥀بی تو بی تو زندگی می کنم، مثل گلشن با من ملاقات خواهی کرد، تو را ملاقات نمی کنم، می میرم، تو حتی پس از به دست آوردن آنچه که به دست آورده ام، زنده خواهی بود..🥀** ",
    " 🌺**صنم به تو سوگند همانطور که من برای خوشبختی تو لازمم تو لازمه زندگی من.**🌺\n\n**تو برای زندگی من لازم هستی.🥀** ",
    " 🌺**عاشق خشم تو شده ام در این دنیای بی رحم یکی هست که مرا به حق کامل تهدید کرده است.**🌺\n\n**🥀هیچ کس در این دنیای بی رحم نیست با خشم تو که مرا به حقیقت محض تهدید کرده است. ",
    " 🌺**چشم با مژه محفوظ است، تپش قلب امانت دل است، این رابطه هم بسیار شیرین است، گاهی میل دارد و گاهی شکایت.**🌺\n\n**تپش قلب است که اعتماد هست، این رابطه هم خیلی شیرین است، گاهی خواسته و گاهی آموزش داده می شود.🥀**. ",
    " 🌺**وقتی مردم عشق را خدا می دانند پس چرا عاشق را بد می دانند. وقتی دنیا خودش قلب سنگی است. پس چرا مردم به سنگ دعا می کنند؟**هی.🥀** ",
    " 🌺**وقتی متوجه عشق شد، تمام روز در کنار ما گریه می کرد، ما هم آنقدر خودخواه بودیم که خودمان را با کفن پوشاندیم و با چشمان بسته خوابیدیم.**🌺\n\n**🥀. وقتی عشق را فهمید، اگر تمام روز از کنارمان رد شوند، ما هم آرزوی این پسر را بیرون می آوریم و با چشمان بسته می خوابیم. ",
    " 🌺**صدایی از گوشه دل می آید. هر لحظه دلمون براش تنگ میشه دل دوباره و دوباره می پرسد که آیا دلتنگ ما هستند **🌺\n**🥀صدایی از گوشه دل می آید، هر لحظه از ما می پرسد، دوباره باز هم چقدر یادش می کنیم، چه او هم ما را به یاد داشته باشد،🥀** ",
    " 🌺**گاهی حرف ها را فراموش می کنم، گاهی چیزها را فراموش می کنم، آنقدر دوستت دارم که کاستم را فراموش می کنم، گاهی که بلند می شوم و از تو دور می شوم، در حین رفتن، خودم را در کنار تو فراموش می کنم.**🌺\n\ ن*** ",
    " 🌺**اگر در آینه نگاه کنی، مرا به یاد می آوری، آن دیداری که با من گذرانی کردی، لحظه ای می ایستد، زمانی که چیزی در مورد من به یاد می آوری اونجا وقتی یکی از حرفای منو یادت میاد.🥀** ",
    " 🌺**وقتی دوست داشتم، عشقشان را دیدم، پلک هایم پر شد، در تپش دو قلب، صدای این قلب آمد.**🌺\n\. n**🥀پیار کیا به دیدن عشقش درد پلکم آورد دلم پر از غم شد دیدی به دلم آمد صدای قلبم به دلم آمد.🥀** ",
    " 🌺**مردم اینجا با چهره های متعدد زندگی می کنند، ما فقط یک چهره را دوست داریم، این چهره را پنهان نکنید، زیرا ما فقط پس از دیدن آن زندگی می کنیم.**🌺\n\n**چون ما چهره را دوست داریم و به چهره اهمیت نمی دهیم زیرا پس از دیدن آن زنده می شویم. ",
    " 🌺**بف هرکسی با حرف زدن با جی اف او می خوابد و مال من نمی تواند بدون دعوا با من بخوابد.**🌺\n\n**بدون تو بخوابم.🥀** ",
    " 🌺**می گویند عشق واقعی در سرنوشت کسی است. کجای این دنیا کسی چنین عشقی پیدا می‌کند؟**🌺\n\n**🥀عشق واقعی، کسی آن عشق را از کجا می‌آورد؟ ",
]
# Command
    


@app.on_message(filters.command(["shayari" ], prefixes=["/", "@", "#"]))
async def mentionall(client, message):
    chat_id = message.chat.id
    if message.chat.type == ChatType.PRIVATE:
        return await message.reply("𝐓𝐡𝐢𝐬 𝐂𝐨𝐦𝐦𝐚𝐧𝐝 𝐎𝐧𝐥𝐲 𝐅𝐨𝐫 𝐆𝐫𝐨𝐮𝐩𝐬.")

    is_admin = False
    try:
        participant = await client.get_chat_member(chat_id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("𝐘𝐨𝐮 𝐀𝐫𝐞 𝐍𝐨𝐭 𝐀𝐝𝐦𝐢𝐧 𝐁𝐚𝐛𝐲, 𝐎𝐧𝐥𝐲 𝐀𝐝𝐦𝐢𝐧𝐬 𝐂𝐚𝐧 . ")

    if message.reply_to_message and message.text:
        return await message.reply("/shayaril  𝐓𝐲𝐩𝐞 𝐋𝐢𝐤𝐞 𝐓𝐡𝐢𝐬 / 𝐑𝐞𝐩𝐥𝐲 𝐀𝐧𝐲 𝐌𝐞𝐬𝐬𝐚𝐠𝐞 𝐍𝐞𝐱𝐭 𝐓𝐢𝐦𝐞 ")
    elif message.text:
        mode = "text_on_cmd"
        msg = message.text
    elif message.reply_to_message:
        mode = "text_on_reply"
        msg = message.reply_to_message
        if not msg:
            return await message.reply("/shayari  𝐓𝐲𝐩𝐞 𝐋𝐢𝐤𝐞 𝐓𝐡𝐢𝐬 / 𝐑𝐞𝐩𝐥𝐲 𝐀𝐧𝐲 𝐌𝐞𝐬𝐬𝐚𝐠𝐞 𝐍𝐞𝐱𝐭 𝐓𝐢𝐦𝐞 ...")
    else:
        return await message.reply("/shayari  𝐓𝐲𝐩𝐞 𝐋𝐢𝐤𝐞 𝐓𝐡𝐢𝐬 / 𝐑𝐞𝐩𝐥𝐲 𝐀𝐧𝐲 𝐌𝐞𝐬𝐬𝐚𝐠𝐞 𝐍𝐞𝐱𝐭 𝐓𝐢𝐦𝐞 ..")
    if chat_id in spam_chats:
        return await message.reply("𝐏𝐥𝐞𝐚𝐬𝐞 𝐀𝐭 𝐅𝐢𝐫𝐬𝐭 𝐒𝐭𝐨𝐩 𝐑𝐮𝐧𝐧𝐢𝐧𝐠 𝐏𝐫𝐨𝐜𝐞𝐬𝐬 ...")
    spam_chats.append(chat_id)
    usrnum = 0
    usrtxt = ""
    async for usr in client.get_chat_members(chat_id):
        if not chat_id in spam_chats:
            break
        if usr.user.is_bot:
            continue
        usrnum += 1
        usrtxt += f"[{usr.user.first_name}](tg://user?id={usr.user.id}) "

        if usrnum == 1:
            if mode == "text_on_cmd":
                txt = f"{usrtxt} {random.choice(SHAYRI)}"
                await client.send_message(chat_id, txt)
            elif mode == "text_on_reply":
                await msg.reply(f"[{random.choice(EMOJI)}](tg://user?id={usr.user.id})")
            await asyncio.sleep(4)
            usrnum = 0
            usrtxt = ""
    try:
        spam_chats.remove(chat_id)
    except:
        pass


#

@app.on_message(filters.command(["shstop", "shayarioff"]))
async def cancel_spam(client, message):
    if not message.chat.id in spam_chats:
        return await message.reply("𝐂𝐮𝐫𝐫𝐞𝐧𝐭𝐥𝐲 𝐈'𝐦 𝐍𝐨𝐭 ..")
    is_admin = False
    try:
        participant = await client.get_chat_member(message.chat.id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("𝐘𝐨𝐮 𝐀𝐫𝐞 𝐍𝐨𝐭 𝐀𝐝𝐦𝐢𝐧 𝐁𝐚𝐛𝐲, 𝐎𝐧𝐥𝐲 𝐀𝐝𝐦𝐢𝐧𝐬 𝐂𝐚𝐧 𝐓𝐚𝐠 𝐌𝐞𝐦𝐛𝐞𝐫𝐬.")
    else:
        try:
            spam_chats.remove(message.chat.id)
        except:
            pass
        return await message.reply("♦ OFFFFFFFFF♦")
